{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"|":96,"}":97,"~":98,"¡":99,"¢":100,"£":101,"¤":102,"¥":103,"¦":104,"§":105,"¨":106,"©":107,"ª":108,"«":109,"¬":110,"®":111,"¯":112,"°":113,"±":114,"²":115,"³":116,"´":117,"µ":118,"¶":119,"·":120,"¸":121,"¹":122,"º":123,"»":124,"¼":125,"½":126,"¾":127,"¿":128,"À":129,"Á":130,"Â":131,"Ã":132,"Ä":133,"Å":134,"Æ":135,"Ç":136,"È":137,"É":138,"Ê":139,"Ë":140,"Ì":141,"Í":142,"Î":143,"Ï":144,"Ð":145,"Ñ":146,"Ò":147,"Ó":148,"Ô":149,"Õ":150,"Ö":151,"×":152,"Ø":153,"Ù":154,"Ú":155,"Û":156,"Ü":157,"Ý":158,"Þ":159,"ß":160,"à":161,"á":162,"â":163,"ã":164,"ä":165,"å":166,"æ":167,"ç":168,"è":169,"é":170,"ê":171,"ë":172,"ì":173,"í":174,"î":175,"ï":176,"ð":177,"ñ":178,"ò":179,"ó":180,"ô":181,"õ":182,"ö":183,"÷":184,"ø":185,"ù":186,"ú":187,"û":188,"ü":189,"ý":190,"þ":191,"ÿ":192,"Ā":193,"ā":194,"Ă":195,"ă":196,"Ą":197,"ą":198,"Ć":199,"ć":200,"Ĉ":201,"ĉ":202,"Ċ":203,"ċ":204,"Č":205,"č":206,"Ď":207,"ď":208,"Đ":209,"đ":210,"Ē":211,"ē":212,"Ĕ":213,"ĕ":214,"Ė":215,"ė":216,"Ę":217,"ę":218,"Ě":219,"ě":220,"Ĝ":221,"ĝ":222,"Ğ":223,"ğ":224,"Ġ":225,"ġ":226,"Ģ":227,"ģ":228,"Ĥ":229,"ĥ":230,"Ħ":231,"ħ":232,"Ĩ":233,"ĩ":234,"Ī":235,"ī":236,"Ĭ":237,"ĭ":238,"Į":239,"į":240,"İ":241,"ı":242,"Ĳ":243,"ĳ":244,"Ĵ":245,"ĵ":246,"Ķ":247,"ķ":248,"ĸ":249,"Ĺ":250,"ĺ":251,"Ļ":252,"ļ":253,"Ľ":254,"ľ":255,"Ŀ":256,"ŀ":257,"Ł":258,"ł":259,"Ń":260,"Ġ:":261,"Ġa":262,"Ġâ":263,"Ġh":264,"Ġ(":265,"ci":266,"ĠÎ":267,"ss":268,"le":269,"on":270,"ĠÎ±":271,"it":272,"sso":273,"te":274,"Ġb":275,"ĠĠ":276,"ate":277,"ciate":278,"ssociate":279,"mm":280,"un":281,"Ġ:=":282,"Ġp":283,"ul":284,"mul":285,"Ġ[":286,"unit":287,"âŁ":288,"in":289,"re":290,"ro":291,"dv":292,"dvd":293,"Ġ{":294,"im":295,"âŁ©":296,"ĠâŁ":297,"Ġassociate":298,"is":299,"Ġr":300,"mk":301,"ĠâŁ¨":302,"id":303,"oid":304,"mon":305,"monoid":306,"ble":307,"du":308,"ĠâĨ":309,"Ġ*":310,"ero":311,"ot":312,"zero":313,"Ġc":314,"ir":315,"associate":316,"ĠâĪ":317,"âĤ":318,"cible":319,"redu":320,"irredu":321,"irreducible":322,"Ġq":323,"omm":324,"if":325,"iff":326,"an":327,"comm":328,"one":329,"lemm":330,"lemma":331,"rim":332,"ĠĠĠ":333,"rime":334,"of":335,"eq":336,"Ġs":337,"Ġassociated":338,"ce":339,"en":340,"imp":341,"Ġassociates":342,"wit":343,"with":344,"ct":345,"Ġmul":346,"ance":347,"or":348,"Ġrw":349,"Ġ=":350,"Ġis":351,"ow":352,"Ġ_":353,"ymm":354,"fl":355,"th":356,"symm":357,"Ġirreducible":358,"not":359,"Ġ}":360,"Ġha":361,"ĠâĪ£":362,"Ġsimp":363,"Ġby":364,"ri":365,"µ¤":366,"áµ¤":367,"Ġ1":368,"Ġprime":369,"associates":370,"Ġ~":371,"ft":372,"Ġâī":373,"left":374,"Ġhp":375,"ĠâĨĴ":376,"âĤĤ":377,"eo":378,"Ġ0":379,"rem":380,"associated":381,"theo":382,"theorem":383,"hp":384,"Ġdvd":385,"âŁ©,":386,"ĠâĨĶ":387,"end":388,"ancel":389,"Î»":390,"Ġn":391,"Ġrfl":392,"âĤģ":393,"cti":394,"cancel":395,"gh":396,"se":397,"ve":398,"Ġx":399,"righ":400,"right":401,"me":402,"ex":403,"Ġu":404,"units":405,"ssu":406,"de":407,"pow":408,"uot":409,"ction":410,"ssume":411,").":412,"Ġf":413,"Ġy":414,"ĠÎ»":415,"Ġin":416,"Ġ},":417,"asso":418,"act":419,"ly":420,"assoc":421,"Ġ$":422,"Ġhu":423,"Ġhx":424,"Ġâīł":425,"exact":426,"),":427,"eg":428,"ien":429,"ne":430,"pp":431,"st":432,"su":433,"tro":434,"Ġmk":435,"uotien":436,"egin":437,"uotient":438,"al":439,"begin":440,"prime":441,"Ġ^":442,"âŁ¨":443,"inst":444,"instance":445,"Ġat":446,"Ġd":447,"pply":448,"Â¬":449,"Ġor":450,"Ġexact":451,"ĠÂ¬":452,"ĸ¸":453,"Ġâĸ¸":454,"ĠĠĠĠ":455,"],":456,"Ġle":457,"Ġapply":458,"intro":459,"Ġquotient":460,"cc":461,"tr":462,"âĨ":463,"Ġâī¤":464,"',":465,"con":466,"Ġre":467,"Ġhave":468,"succ":469,"ase":470,"ha":471,"Ġm":472,"Ġwith":473,"Ġassume":474,"rom":475,"Ġfrom":476,"ases":477,"..":478,"by":479,"Ġ[âĨ":480,"ĠâĨĲ":481,"Ġ[âĨĲ":482,"able":483,"assume":484,"duction":485,"ĠâĪ¨":486,"this":487,"Ty":488,"cases":489,"how":490,"pe":491,"ĠTy":492,"ĠĠĠĠĠ":493,"Ġpow":494,"ing":495,"ĠType":496,"fin":497,"gr":498,"Ġo":499,"Ġnot":500,"Ġunits":501,"Ġ..":502,"Ġhb":503,"âŁ©)":504,"Ġrefin":505,"Ġrefine":506,"cte":507,"mp":508,"sing":509,"Ë£":510,"Ġthis":511,"Ħķ":512,"ĠâĦķ":513,"Ġ((":514,"ĠÎ²":515,"tecte":516,"rotecte":517,"Ġcon":518,"der":519,"congr":520,"rotected":521,"*}":522,"iq":523,"lt":524,"Â¹":525,"Î±":526,"ģ»":527,"let":528,"uniq":529,"inv":530,"Ġrintro":531,"ans":532,"trans":533,"ap":534,"om":535,"âģ»":536,"Ġi":537,"Ġlemma":538,"Ġhc":539,"Ġhq":540,"induction":541,"refl":542,"ĠâĪ§":543,"Ġrwa":544,"section":545,"@[":546,"Pro":547,"ain":548,"ari":549,"bt":550,"protected":551,"ue":552,"vari":553,"Ġk":554,"ĠPro":555,"ĠâŁ¦":556,"Ġrcases":557,"ĠâĪĢ":558,"Ġ_)":559,"Ġobt":560,"unique":561,"variable":562,"ĠProp":563,"Ġobtain":564,"at":565,"so":566,"âĪ":567,"Ġde":568,"Ġhd":569,"Ġhn":570,"Ġcomm":571,"oral":572,"Ġhab":573,"Ġsimpa":574,"Ġusing":575,"Ġih":576,"orall":577,"))":578,"AB":579,"HAB":580,"bot":581,"cal":582,"nd":583,"quotient":584,"Ġ+":585,"Ġone":586,"Ġand":587,"ĠÎ±Ë£":588,"inj":589,"Ġshow":590,"order":591,"Ġintro":592,"Ġlet":593,"variables":594,"]âŁ©":595,"ecti":596,"simp":597,"show":598,"to":599,"âŁ§":600,"inl":601,"ĠâŁ§":602,"âĤĢ":603,"Ġforall":604,"ective":605,"]âŁ©)":606,"ass":607,"dable":608,"hq":609,"hu":610,"lit":611,"lass":612,"rt":613,"ĠB":614,"Ġl":615,"Ġon":616,"Ġeq":617,"Ġtheorem":618,"Ġhi":619,"cidable":620,"Ġbot":621,"und":622,"Ġ[*":623,"inr":624,"ist":625,"Ġ_,":626,"Ġhas":627,"sub":628,"ĠĠĠĠĠĠĠ":629,"tra":630,"hab":631,"Ġhba":632,"sound":633,"Ġonly":634,"di":635,"el":636,"hom":637,"ial":638,"ical":639,"oe":640,"pa":641,"plit":642,"toid":643,"},":644,"Î²":645,"Ġunique":646,"Ġhv":647,"Ġ(âĪ":648,"ĠâĨĳ":649,"Ġcancel":650,"ĠâĪĥ":651,"Ġsplit":652,"Ġ_âŁ©,":653,"Ġ_),":654,"exist":655,"Ġinduction":656,"Ġorder":657,"ĠĠĠĠĠĠĠĠĠ":658,"Ġrefl":659,"have":660,"Ġdef":661,"top":662,"Ġ[*,":663,"elim":664,"Ġ(âĪĢ":665,"exists":666,"'âŁ©":667,"];":668,"_,":669,"ame":670,"hn":671,"hs":672,"hv":673,"mt":674,"name":675,"rw":676,"rfl":677,"spa":678,"tri":679,"£)":680,"Ġ<":681,"ĠA":682,"Ġe":683,"Ġz":684,"ĠHAB":685,"Ġhy":686,"unction":687,"âŁ¦":688,"rel":689,"âŁ©âŁ©":690,"ĠâŁ¨_,":691,"Ġclass":692,"irr":693,"Ġquot":694,"impor":695,"vert":696,"Ġfunction":697,"contra":698,"Ġmap":699,"singlet":700,"Ġ((âĪ":701,"Ġconv":702,"Ġdecidable":703,"injective":704,"Ġintros":705,"namespa":706,"Ġclassical":707,"import":708,"singleton":709,"Ġ((âĪ£)":710,"namespace":711,")]":712,")).":713,"apply":714,"br":715,"coe":716,"dd":717,"er":718,"etoid":719,"ebr":720,"gebr":721,"hb":722,"hc":723,"hinv":724,"jective":725,"lve":726,"lhs":727,"lgebr":728,"non":729,"nat":730,"os":731,"pos":732,"qp":733,"vial":734,"ĠH":735,"ĠM":736,"Ġg":737,"Ġof":738,"Ġexists":739,"Ĭ¥":740,"Ġalgebr":741,"Ġprotected":742,"red":743,"rep":744,"reso":745,"ĠâŁ¨âŁ¨":746,"ĠâŁ¨âŁ¦":747,"Ġcases":748,"Ġcom":749,"Ġqp":750,"Ġsetoid":751,"Ġ_).":752,"Ġndvd":753,"def":754,"dered":755,"sur":756,"âĨĳ":757,"has":758,"Ġ...":759,"Ġconvert":760,"Ġrintros":761,"ĠâĪĢ(":762,"atom":763,"subsingleton":764,"Ġhbax":765,"diction":766,"trivial":767,"Ġalgebra":768,"resolve":769,"Ġcomap":770,"''":771,"')":772,"']":773,"'âŁ©)":774,"):":775,"*)":776,"_.":777,"ab":778,"aul":779,"add":780,"class":781,"forall":782,"hk":783,"hx":784,"iv":785,"lf":786,"lo":787,"map":788,"oun":789,"ose":790,"vis":791,"zing":792,"})":793,"};":794,"âĢ":795,"ĠF":796,"ĠG":797,"Ġ`":798,"Ġ|":799,"Ġunit":800,"Ġmonoid":801,"Ġzero":802,"Ġuniq":803,"Ġtrans":804,"Ģ¹":805,"ĠâĬ¥":806,"ĠâĢ¹":807,"Ġhk":808,"Ġhz":809,"Ġhlt":810,"Ġhcontra":811,"Ġ(@":812,"Ġ(â":813,"Ġ(âŁ¨":814,"Ġ(âĨĳ":815,"Ġbne":816,"rec":817,"reorder":818,"root":819,"âŁ©),":820,"ĠâŁ©":821,"ĠâŁ¨(":822,"Ġ*)":823,"Ġcal":824,"Ġcoe":825,"Ġsu":826,"ordered":827,"Ġhac":828,"Ġhpd":829,"Ġhpab":830,"ĠâĨĴ*":831,"Î»a":832,"Ġne":833,"Ġnz":834,"Ġnat":835,"setoid":836,"self":837,"ext":838,"Ġuse":839,"ded":840,"decidable":841,"ĠÎ»a":842,"str":843,"ĠĠĠĠĠĠ":844,"trap":845,"mpr":846,"Ġcontra":847,"Ġcontrap":848,"Ġhcd":849,"ĠâĪĢ{":850,"Ġhdc":851,"Ġhno":852,"âŁ§,":853,"ĠâŁ§,":854,"ĠâŁ§âŁ©":855,"]âŁ©))":856,"rtial":857,"divis":858,"Ġdefaul":859,"nontrivial":860,"surjective":861,"local":862,"ounded":863,"âĢº":864,"Ġcalc":865,"Ġcontradiction":866,"Ġcontrapose":867,"Ġdefault":868}